[
  {
    "from": "TT",
    "to": "BB",
    "category": "university_graduate",
    "eligible": true,
    "summary": "As a university graduate from Trinidad and Tobago moving to Barbados, you may apply for a CARICOM Skills Certificate and verify it with the Barbadian Competent Authority.",
    "notes": [
      "You must hold a recognized university degree from an accredited institution.",
      "You can enter Barbados to seek work without a work permit once you have a valid Skills Certificate.",
      "Free movement of skills does not grant automatic permanent residency or citizenship.",
      "You must comply with immigration requirements in Barbados at all times."
    ],
    "checklist": [
      "Valid CARICOM passport",
      "Certified copy of university degree",
      "Official transcript (if required by host country)",
      "Police Certificate of Character",
      "Passport-sized photographs",
      "Completed Skills Certificate application form",
      "Proof of CARICOM nationality"
    ],
    "competentAuthorityHint": "Confirm the current Competent Authority for Barbados on the official government website."
  },
  {
    "from": "TT",
    "to": "GY",
    "category": "teacher",
    "eligible": true,
    "summary": "Qualified teachers from Trinidad and Tobago can apply for a Skills Certificate to work in Guyana under free movement of skills.",
    "notes": [
      "You must provide proof of teaching qualifications and professional registration where applicable.",
      "You do not require a separate work permit once your Skills Certificate is accepted by Guyanese authorities.",
      "You still need to follow Guyana’s immigration rules for length and type of stay."
    ],
    "checklist": [
      "Valid CARICOM passport",
      "Teaching diploma/degree",
      "Proof of teacher registration or license (if applicable)",
      "Police Certificate of Character",
      "Passport-sized photographs",
      "Completed Skills Certificate application form"
    ],
    "competentAuthorityHint": "Verify which Ministry or agency in Guyana acts as the Competent Authority for teachers."
  }
]
